import { Grid, Paper, Typography } from "@material-ui/core";
import React, { useState } from "react";
import Layout from "../../../Layout/Layout";
import { termsAndConditionsData } from "./constants";
import classes from "./termsAndConditions.module.css";
const TermsAndConditions = (props) => {
  const [list, setList] = useState(termsAndConditionsData);

  const selectHandler = (id) => {
    const updatedTasks = list.map((task) => {
      if (id === task.id) {
        return { ...task, active: true };
      }
      return { ...task, active: false };
    });
    setList(updatedTasks);
  };
  return (
    <Layout>
      <Paper elevation={3} className={classes.urlPage}>
        پارک جاب/ قوانین و مقررات
      </Paper>
      <Grid container>
        <Grid item md={3} xs={12}>
          <ul className={classes.list}>
            {list.map((item) => (
              <li key={item.id} onClick={() => selectHandler(item.id)}>
                <a
                  className={` ${classes.itemList} ${
                    item.active ? classes.active : null
                  }`}
                  href={item.href}
                >
                  {item.title}
                </a>
              </li>
            ))}
          </ul>
        </Grid>
        <Grid item md={9} xs={12}>
          <div className={classes.content}>
            <h2>قوانین و مقررات</h2>
            <div className={classes.date}>
              آخرین به روزرسانی:<span>5اردیبهشت 1400</span>{" "}
            </div>
            <Typography>
              قوانین پیش رو، راهنما ها، دستورالعمل ها، مرامنامه و مطالبی که در
              این سایت، پیش روی شما قرار داده شده است، یک قرارداد قانونی است بین
              شما ("شما" = "کاربر") و پارک جاب ("ما" = "پارک جاب"، "parkJob.ir")
              که به آن از این به بعد "قوانین" می گوییم. با ورود به سایت پارک جاب
              parkJob.ir و سایت های وابسته و زیر مجموعه ها، ساب دامنه ها
              ("سایت")، شما موافقت خود را با این قوانین اعلام می دارید. پارک جاب
              این حق را برای خود محفوظ می دارد تا در هر زمان، تمامی یا بخشی از
              این قوانین را بدون اطلاع قبلی اصلاح کند. اصلاحیه ها از زمان ثبت در
              سایت معتبر می باشند.
            </Typography>
            <h3 id="Overview">(1) بررسی کلی</h3>
            <Typography>
              سایت پارک جاب صرفا به عنوان یک واسطه بین کارفرما و پیمانکار
              ("فریلنسرها") بوده و نقش یک بنگاه را ایفا می کند. پارک جاب بازار
              کار آنلاین و پلتفرم برون سپاری و جمع سپاری است که به
              ("کارفرمایان") این امکان را می دهد تا پروژه های خود را برون سپاری
              کنند و فریلنسرها با انجام پروژه ها، کسب درآمد کنند. سایت شامل
              امکاناتی است که به کاربران کمک می کند بتوانند به راحتی با یکدیگر
              کار کنند. امکانات کارفرمایان: ایجاد پروفایل، ایجاد پروژه، جستجوی
              فریلنسر، گفتگوی آنلاین، سپردن پروژه به فریلنسر، میزکار و مدیریت
              پروژه، سیستم پرداخت امن، سیستم حل اختلاف، سیستم نظر و رتبه.
              امکانات فریلنسرها: ایجاد پروفایل، ثبت نمونه کار، انتخاب مهارت، پلن
              های عضویت، ارسال پیشنهاد، میزکار و مدیریت پروژه، سیستم پرداخت امن،
              سیستم حل اختلاف، سیستم نظر و رتبه، دریافت وجه.
            </Typography>
            <h3 id="Register">(2) ثبت نام</h3>
            <ul>
              <li>
                تمامی کاربران اینترنتی اعم از اشخاص حقیقی و حقوقی می توانند از
                امکانات پارک جاب استفاده کنند، به استثنای اشخاص با سن کمتر از 18
                سال. برای استفاده از سایت، می بایست موافقت خود را با تمامی
                قوانین سایت اعلام کنید. شما موافقت می کنید (1) طبق قوانین،
                دستورالعمل ها، و مرامنامه سایت رفتار کنید و به موارد گفته شده
                عمل کنید (2) مسئولیت مالی استفاده از سایت، خریدها، خدمات دریافت
                شده را بر عهده بگیرید (3) تعهدات خود را در قبال پروژه ای که
                دارید انجام دهید، مگر اینکه این تعهدات خلاف قوانین کشور جمهوری
                اسلامی ایران یا سایت پارک جاب باشد.
              </li>
              <li>
                شما مجاز به ساختن بیش از یک حساب کاربری برای استفاده از امکانات
                کارفرمایی یا فریلنسر نمی باشید. با یک حساب کاربری از هر دو این
                امکانات می توان به راحتی استفاده کرد. ایجاد دو حساب کاربری در
                پارک جاب مجاز نمی باشد. در هنگام ثبت نام از شما درخواست می شود
                تا نام کاربری و رمز عبور برای حساب خود انتخاب کنید. شما بصورت
                کامل در حفظ و نگهداری رمز عبور خود مسئول هستید. ما با مشاهده
                هرگونه فعالیت در حساب شما چنین برداشت خواهیم کرد که شما یا فردی
                که از طرف شما اجازه دسترسی به او داده شده است وارد حساب کاربری
                شما شده است. درصورت مشکوک شدن به دسترسی غیر مجاز به حساب خود،
                بلافاصله از طریق بخش پشتیبانی به ما اطلاع دهید.
              </li>
              <li>
                پارک جاب عضویت های مختلفی برای فریلنسرها دارد. فریلنسرها می
                توانند عضویت مورد نیاز را انتخاب کنند. برای اطلاع از قیمت ها، به
                صفحه تعرفه ها مراجعه کنید. هرکدام از پلن ها تعداد مشخصی پیشنهاد
                دارند. فریلنسرها از این امکان برای ارسال پیشنهاد روی پروژه ها
                استفاده می کنند. درصورت به پایان رسیدن محدودیت پیشنهاد در ماه،
                می توانید عضویت خود را به پلن بالاتر ارتقا دهید. با ارتقا به پلن
                بالاتر، امکانات پلن بالاتر اضافه خواهد شد، اما زمان عضویت تغییر
                نخواهد کرد. پارک جاب این حق را برای برای خود محفوظ می دارد تا
                مبلغ عضویت یا تعداد پیشنهادهای ماهانه را در هر زمان تغییر دهد.
                پلن فروخته شده پس گرفته نخواهد شد و هیچ وجه و مبلغی بعد از خرید
                بازگردانده نمی شود.
              </li>
            </ul>
            <h3 id="EmployerRelations">(3) روابط کارفرما و فریلنسر</h3>
            <ul>
              <li>
                برای انجام پروژه در سایت پارک جاب، کارفرما و پیمانکار بصورت
                مستقیم با هم در ارتباط اند. بصورتی که بعد از ارسال پیشنهاد،
                کارفرما بهترین پیشنهاد یا پیشنهادها را انتخاب، و فریلنسر انجام
                پروژه را قبول می کند. کارفرما موافقت می کند خرید کند، و فریلنسر
                موافقت می کند که سرویس و باقی ملزومات را طبق توافق پیش رو تحویل
                دهد (a) قرارداد بین کارفرما و فریلنسر شامل توضیحات پروژه،
                پیشنهاد فریلنسر، و باقی شرایط و قوانینی است که بین کارفرما و
                فریلنسر در سایت توافق شده، (b) قوانین سایت، (c) و هر مطلب و فایل
                دیگری که در سایت آپلود شده و مورد توافق طرفین قرار گرفته شده
                باشد، می باشد. شما موافقت می کنید که وارد هیچ توافقی که قوانین
                سایت را نقض کند نشوید. هر توافقی که قوانین سایت را نقض کند باطل
                است. کارفرما مسئولیت مدیریت، بررسی، پیگیری و پرداخت در زمان مقرر
                برای دریافت نتیجه مطلوب را بر عهده دارد و فریلنسر مسئولیت ارائه
                خدمات با کیفیت در زمان مقرر بر اساس توافق انجام شده را بر عهده
                دارد. کارفرما و فریلنسر هر دو موافقت می کنند در جهت انجام اجرای
                توافق با یکدیگر همکاری، و منصفانه رفتار کنند.
              </li>
              <li>
                کارفرما و فریلنسر توجه دارند و موافقند که هر کدام به عنوان فردی
                مستقل رفتار می کنند. فریلنسر به عنوان یک پیمانکار مستقل، سرویس
                خود را ارائه می کند و هیچ رابطه شراکت، کارفرما و کارمند، مشارکت،
                نماینده یا هر چیز دیگری بین کارفرما و فریلنسر یا بین پارک جاب با
                کارفرما و فریلنسر وجود ندارد.
              </li>
            </ul>
            <h3 id="UserRelationships">(4) روابط کاربران و پارک جاب</h3>
            <ul>
              <li>
                پارک جاب طرف حساب در توافقات، قرادادها و درخواست های پروژه ها
                بین کارفرما و فریلنسر نیست. پارک جاب هیچ کنترلی روی پروژه ها
                ندارد و از جزئیات آن آگاه نیست. پارک جاب مواردی از قبیل کیفیت
                انجام پروژه، امنیت و قانونی بودن سرویس تحویل داده شده، درست و
                دقیق بودن پروژه های ثبت شده، سطح دانش، پیشینه یا توان کاربران،
                اطمینان از انجام کار توسط فریلنسر، توان مالی کارفرما برای پرداخت
                بعد از انجام پروژه، یا اینکه فریلنسر یا کارفرما پروژه را تا
                انتها ادامه خواهند داد یا خیر، را تضمین نمی کند. پارک جاب مسئول
                رفتار فریلنسرها نیست و فریلنسرها کارمندان پارک جاب نمی باشند.
                تمام حقوق و تعهدات خرید و فروش خدمات بین کارفرما و فریلنسر خواهد
                بود. پارک جاب هیچ وسیله یا ابزاری برای انجام پروژه ها در اختیار
                فریلنسرها قرار نخواهد داد. کارفرما و فریلنسر می بایست با یکدیگر
                تمام مسائلی که مربوط به حقوق و تعهدات می باشد را حل و فصل کنند.
              </li>
              <li>
                کارفرما و فریلنسر توجه دارند و موافقند که ارزش، اعتبار و حسن نیت
                سایت، بستگی به عملکرد آنها در انجام پروژه دارد. به همین خاطر
                پارک جاب به عنوان یک شخص سوم بر پروژه ها نظارت خواهد داشت تا دو
                طرف به موقع تعهدات خود را اجرا کنند.
              </li>
              <li>
                هر نوع استفاده شما از سایت، شما را به شریک، نماینده، و شعبه بین
                شما و پارک جاب تبدیل نخواهد کرد.
              </li>
            </ul>
            <h3 id="Tariff">(5) تعرفه های پارک جاب</h3>
            <Typography>
              هزینه عضویت. فریلنسرها می توانند پلن های مختلفی را با توجه به نیاز
              خود انتخاب کنند. جزئیات امکانات و قیمت ها در صفحه تعرفه ها مشخص
              شده است. هزینه خدمات. پارک جاب 10% هزینه خدمات از فریلنسرها دریافت
              می کند. این مبلغ، زمانی که پرداخت امن برای فریلنسر آزاد می شود کسر
              می شود. همینطور کارفرما 5% هزینه خدمات پرداخت می کند و این مبلغ به
              پرداخت امنی که کارفرما ایجاد می کند اضافه می شود. پارک جاب این حق
              را برای خود محفوظ می دارد تا در هر زمان هزینه خدمات، قیمت عضویت، و
              یا هر هزینه دیگری که دریافت می کند را تغییر دهد.
            </Typography>
            <h3 id="SecurePayment">(6) پرداخت امن</h3>
            <Typography>
              پرداخت امن. روش امنی است برای پرداخت پروژه توسط کارفرما که آن را
              در دو مرحله انجام خواهد داد. پرداخت های پروژه ها از طریق ایجاد
              پرداخت امن انجام می شود. پرداخت پروژه از طریق پرداخت مبلغ به پارک
              جاب انجام می شود. کارفرما در نظر دارد که پس از پرداخت به پارک جاب،
              دیگر دسترسی به مبلغ نخواهد داشت. پارک جاب فقط مبلغ را پس از اعلام
              رضایت کارفرما، به حساب فریلنسر منتقل می کند. درصورتی که پروژه
              انجام نشود، فریلنسر می تواند پرداخت امن را لغو کند تا به کارفرما
              بازگردانده شود یا درصورت بروز اختلاف، کارفرما یا فریلنسر می توانند
              وارد سیستم حل اختلاف پارک جاب شوند. اختلاف. درصورتی که فریلنسر یا
              کارفرما اختلاف ایجاد کنند. کارفرما و فریلنسر موافقت می کنند تا
              مشخص شدن وضعیت اختلاف، پارک جاب هیچ پرداختی به هیچ یک از طرفین
              انجام ندهد.
            </Typography>
            <h3 id="WithdrawalRequest">(7) درخواست برداشت</h3>
            <Typography>
              شما می بایست روش و شماره حسابی که می خواهید از سایت برداشت کنید را
              در تنظیمات مشخص کنید. برای برداشت از پارک جاب حساب کاربری شما می
              بایست تایید شده باشد. یعنی نام و شماره موبایل می بایست از طریق
              ارسال تصویر کارت ملی و ارسال پیامک تایید شود. پارک جاب به در خواست
              های برداشت پس از 4 روز کاری رسیدگی می کند. درصورتی که فعالیت
              مشکوکی در حساب شما مشاهده شده باشد، پارک جاب این حق را برای خود
              محفوظ نگه داشته تا زمان مشخص شدن مشکل به درخواست رسیدگی نکند.
            </Typography>
            <h3 id="OtherPaymentRules">(8) سایر قوانین پرداخت</h3>
            <ul>
              <li>
                پرداخت های امن آزاد شده نهایی است وقتی پرداخت امن توسط شما آزاد
                می شود، نهایی و غیر قابل بازگشت می باشد و کارفرما توجه دارد و
                موافقت خود را اعلام می دارد که (i) وقتی پرداخت امن آزاد می شود
                دیگر پارک جاب هیچ مسئولیتی در قبال پرداخت امن ندارد (ii) فریلنسر
                کار مربوط به پرداخت امن آزاد شده را انجام داده، و کارفرما از کار
                تحویل گرفته شده رضایت کامل دارد (iii) کارفرما پارک جاب را در
                قبال مبلغ آزاد شده از هر گونه مسئولیتی مبرا می داند.
              </li>
              <li>
                پرداخت فقط از طریق پرداخت امن به عنوان کارفرما، شما موافقت می
                کنید که فقط از طریق پرداخت امن، هزینه پروژه را به فریلنسر پرداخت
                کنید، چه در اولین پرداخت، چه پرداخت های بعدی، و چه پروژه های
                بعدی. همچنین شما تعهد می کنید که به صورت عمد یا غیر عمد کاری
                نکنید که باعث دور زدن پارک جاب شود. به عنوان فریلنسر شما موافقت
                می کنید فقط از طریق پرداخت امن هزینه پروژه را از کارفرما دریافت
                کنید چه در اولین پرداخت، چه پرداخت های بعدی، و چه پروژه های
                بعدی. همچنین شما تعهد می کنید که به صورت عمد یا غیر عمد کاری
                نکنید که باعث دور زدن پارک جاب شود.
              </li>
            </ul>
            <h3 id="Report">(9) گزارش</h3>
            <Typography>
              به عنوان کارفرما شما موافقت می کنید بلافاصله از طریق سیستم گزارش،
              فریلنسرهایی که درخواست پرداخت خارج از پارک جاب را دارند گزارش
              کنید. به عنوان فریلنسر شما موافقت می کنید بلافاصله از طریق سیستم
              گزارش کارفرمایانی که درخواست پرداخت خارج از پارک جاب را دارند
              گزارش کنید. اگر شما از مشکلی یا پتانسیل دورزدن از پرداخت امن پارک
              جاب اطلاع دارید، آن را به ما گزارش کنید.
            </Typography>
            <h3 id="DisputeResolution">(10) حل اختلاف</h3>
            <Typography>
              سیستم حل اختلاف پارک جاب برای زمانی است که مبلغی به صورت پرداخت
              امن ایجاد شده و هنوز توسط کارفرما آزاد نشده باشد. در صورتی بروز هر
              گونه مشکل، کارفرما یا فریلنسر هر دو می توانند برای دریافت مبلغ
              اختلاف ایجاد کنند. (i) زمانی که کار تحویل کارفرما شده باشد و
              کارفرما پرداخت امن را برای فریلنسر آزاد نکند (ii) زمانی که فریلنسر
              پاسخگو نبوده یا (iii) زمانی که پروژه تحویل داده شده از کیفیت مناسب
              برخوردار نباشد روش کار مذاکره. پس از ایجاد اختلاف توسط هر کدام از
              طرفین، طرف مقابل از طریق اطلاعیه های پارک جاب مطلع شده و موافقت می
              کند در کمتر از 5 روز در گفتگوی اختلاف حاضر شود. در صورت عدم حضور
              در موعد مقرر، پارک جاب چنین در نظر خواهد گرفت که کاربر مقصر بوده و
              ممکن است رای به نفع کاربری که اختلاف ایجاد کرده است، صادر شود. پس
              از ایجاد اختلاف، کارفرما و فریلنسر موافقت می کنند از طریق مذاکره
              مشکل را بین خود حل کنند. اگر نتیجه مذاکره مورد قبول هر دو طرف بود،
              با اعلام آن، پارک جاب پرداخت امن را بر اساس توافق پرداخت می کند.
              اگر شما از نتیجه مذاکره ناراضی بودید موافقت می کنید درخواست داوری
              ایجاد کنید. در حل اختلاف های بین کارفرما و فریلنسر که از طریق
              مذاکره حل و فصل نمی شود، موافقت می کنید تا پارک جاب به عنوان سوم
              شخص یا سوم شخصی که از طرف پارک جاب انتخاب می شود اختلاف را داوری
              کند
            </Typography>
            <h3 id="TerminationAndSuspension">(11) خاتمه دادن و تعلیق</h3>
            <Typography>
              .این قوانین از زمانی که شما از سایت پارک جاب استفاده می کنید لازم
              الاجرا است. درصورتی که شما قوانین سایت را رعایت نکنید، ممکن است
              بدون اخطار حساب کاربری شما مسدود شود شما توجه دارید و موافقت می
              کنید که اگر انجام پروژه ای که قبول کرده اید را بدون دلیل موجه رد
              کنید، یا درصورتی وارد اختلاف شوید که حق کاملا با کارفرما باشد و
              کارفرما از عملکرد شما شکایت کند، هزینه خدمات پارک جاب را برای بار
              اول به صورت کامل به عنوان جریمه پرداخت کنید و درصورت تکرار، حساب
              کاربری شما مسدود خواهد شد. زمانی که حساب کاربری شما مسدود شود، شما
              دیگر قادر به ورود به سایت نخواهید بود، و دیگر دسترسی به پیام ها،
              فایل ها و اطلاعات دیگری که در حساب خود دارد را نخواهید داشت. وقتی
              حساب کاربری شما مسدود می شود، شما مجاز به ساختن حساب کاربری دیگر
              برای استفاده از خدمات این سایت نمی باشید.
            </Typography>
            <h3 id="IntellectualOwnershipOfUserContent">
              (12) مالکیت معنوی محتوای کاربران
            </h3>
            <Typography>
              شما به شخصه مسئول تمام محتوایی هستید که در سایت پارک جاب به انتشار
              قرار می دهید. برای مثال (a) هر محتوایی که شامل تصویر، صدا یا ویدیو
              باشد (محتوای چند رسانه ای) (b) هر پستی، نظر یا مطلبی در فضای عمومی
              وب سایت، پیام های خصوصی و هر جای دیگر (c) هر محتوایی که در بخش
              هایی مانند پروفایل، نمونه کار، رزومه، پروژه، نظرات و ... ثبت می
              کنید. شما بصورت کامل مالک و مسئول تمام محتوایی هستید که در سایت
              پارک جاب انتشار می دهید. بدین ترتیب شما به پارک جاب این اجازه و حق
              را می دهید تا از این محتوا در جهت تبلیغات خدمات و سرویس های خود
              استفاده کند. اطلاعات و محتوای شما نباید (a) حقوق دیگران را نقض کند
              و نباید در تداخل با حقوق مالکیت معنوی با دیگران قرار گیرد (b) باعث
              عصبانیت، تهدید، آزار و اذیت دیگران شود (c) همینطور نباید مغایر با
              شئونات اخلاقی باشد. پارک جاب صحت اطلاعاتی که کاربران ارائه داده
              اند را تائید نمی کند و پارک جاب مسئولیتی در قبال هر گونه اطلاعاتی
              که کاربران در این سایت منتشر می کنند، ندارد.
            </Typography>
            <h3 id="Limitations">(13) محدودیت ها</h3>
            <Typography>
              همه کاربران موافقت دارند که: مسئولیت کامل تمامی اعمالی که از طریق
              حساب کاربری شان انجام می شود را بپذیرند. از هیچ روش مکانیزه یا
              دستی برای جمع آوری، کپی و تکثیر اطلاعات سایت و صفحات پارک جاب
              استفاده نکنند. از هیچ روشی برای ارسال هرزنامه (اسپم) به دیگر
              کاربران استفاده نکنند. با فریلنسرها و کارفرمایان به منظور متقاعد
              کردن آنها از عدم استفاده از امکانات پارک جاب، تماس حاصل نکنند.
              وارد درگیری‌های لفظی، غیراخلاقی، بی‌ادبی و رفتارهای غیرحرفه ای با
              یکدیگر نشوند. بیش از یک حساب کاربری در پارک جاب ایجاد نکنند. سلب
              مسئولیت خدمات ارائه شده در پارک جاب بدون هرگونه ضمانت ارائه می
              شود. وقتی شما با کاربر دیگری وارد اختلاف می شوید، پارک جاب را از
              هرگونه ادعا، تقاضا و زیان در ارتباط با اختلاف بوجود آمده مبرا
              بدانید.
            </Typography>
          </div>
        </Grid>
      </Grid>
    </Layout>
  );
};

export default TermsAndConditions;
